In [32]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
dframe = DataFrame({'key1':['X','X','Y','Y','Z'],
                    'key2':['alpha','beta','alpha','beta','alpha'],
                    'dataset1':np.random.randn(5),
                    'dataset2':np.random.randn(5)})

In [3]:
dframe

  key1   key2  dataset1  dataset2
0    X  alpha  1.593561  0.090469
1    X   beta  2.316376 -1.478265
2    Y  alpha -0.115172 -1.443186
3    Y   beta -0.070656 -0.297511
4    Z  alpha -0.481549 -0.393300

In [4]:
group1 = dframe['dataset1'].groupby(dframe['key1'])

In [5]:
group1

In [6]:
group1.mean()

key1
X    1.954969
Y   -0.092914
Z   -0.481549
Name: dataset1, dtype: float64

In [7]:
cities = np.array(['NY','NY','LA','NY','LA'])

month = np.array(['feb','jan','jan','feb','feb'])

In [8]:
dframe['dataset1'].groupby([cities,month]).mean()

LA  feb   -0.481549
    jan   -0.115172
NY  feb    0.761453
    jan    2.316376
Name: dataset1, dtype: float64

In [9]:
dframe

  key1   key2  dataset1  dataset2
0    X  alpha  1.593561  0.090469
1    X   beta  2.316376 -1.478265
2    Y  alpha -0.115172 -1.443186
3    Y   beta -0.070656 -0.297511
4    Z  alpha -0.481549 -0.393300

In [10]:
dframe.groupby(['key1','key2']).mean()

            dataset1  dataset2
key1 key2
X    alpha  1.593561  0.090469
     beta   2.316376 -1.478265
Y    alpha -0.115172 -1.443186
     beta  -0.070656 -0.297511
Z    alpha -0.481549 -0.393300

In [12]:
dframe.groupby(['key1']).size()

key1
X    2
Y    2
Z    1
dtype: int64

In [36]:
for name,groupe in dframe.groupby('key1'):
     print ("this is the %s group" %name)
     print (groupe)
     print ('\n')

this is the X group
  key1   key2  dataset1  dataset2
0    X  alpha  1.593561  0.090469
1    X   beta  2.316376 -1.478265


this is the Y group
  key1   key2  dataset1  dataset2
2    Y  alpha -0.115172 -1.443186
3    Y   beta -0.070656 -0.297511


this is the Z group
  key1   key2  dataset1  dataset2
4    Z  alpha -0.481549   -0.3933

In [56]:
for (k1,k2), group in dframe.groupby(['key1','key2']):
     print ("k1 = %s  k2 = %s" %(k1,k2))
     print (group)
     print ('\n')

k1 = X  k2 = alpha
  key1   key2  dataset1  dataset2
0    X  alpha  1.593561  0.090469


k1 = X  k2 = beta
  key1  key2  dataset1  dataset2
1    X  beta  2.316376 -1.478265


k1 = Y  k2 = alpha
  key1   key2  dataset1  dataset2
2    Y  alpha -0.115172 -1.443186


k1 = Y  k2 = beta
  key1  key2  dataset1  dataset2
3    Y  beta -0.070656 -0.297511


k1 = Z  k2 = alpha
  key1   key2  dataset1  dataset2
4    Z  alpha -0.481549   -0.3933

In [49]:
group_dict = dict(list(dframe.groupby('key1'))

SyntaxError: unexpected EOF while parsing (<ipython-input-49-ea034376bf13>, line 1)

In [50]:
group_dict['X']

  key1   key2  dataset1  dataset2
0    X  alpha  1.593561  0.090469
1    X   beta  2.316376 -1.478265

In [53]:
group_dict_axis1 = dict(list(dframe.groupby(dframe.dtypes, axis=1)))

In [54]:
group_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0  1.593561  0.090469
 1  2.316376 -1.478265
 2 -0.115172 -1.443186
 3 -0.070656 -0.297511
 4 -0.481549 -0.393300,
 dtype('O'):   key1   key2
 0    X  alpha
 1    X   beta
 2    Y  alpha
 3    Y   beta
 4    Z  alpha}

In [57]:
dataset = dframe.groupby(['key1','key2'])[['dataset2']]

dataset.mean()

            dataset2
key1 key2
X    alpha  0.090469
     beta  -1.478265
Y    alpha -1.443186
     beta  -0.297511
Z    alpha -0.393300